temp/test_create_candidate.yaml
config:
  target: "http://149.28.154.143:5000/api/v1"
  phases:
    - duration: 20
      arrivalRate: 2 # Number of users arriving per second
      name: Spike phase

scenarios:
  - name: "Create Candidate"
    flow:
      - post:
          url: "/login"
          json:
            username: "user.test.01"
            password: "pass1234"
          capture:
            - json: "$.data.token" # Capture the token from the login response
              as: "jwtToken"

      - post:
          url: "/candidate" # Use JWT to hit the API and get the WebSocket URL
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          json:
            cnd_name: "test altillery"
            last_name: "14-10"
            email: "asd@asd.com"
            position: "asd"
            gender: "male"
            language: "indonesia"
            organization: "asd"
            start_login: "2024-10-11 00:00:00.000"
            expire_login: "2024-10-31 00:00:00.000"
            self_capture: "0"
            proctoring: "0"
            assessment_center: "0"
            olinterview: "0"
            id_battery: 12
            id_cnd_group: 0
            id_welcome_page: 0
            id_biodata_template: 0
            education_degree: []
            education_university_name: []
            education_university_status: []
            education_major: []
            job_function_id: []
            job_level_id: []